#include <iostream>
#include <iomanip>
#include <cmath>
using namespace std;

int main()
{
    // Оголошення змінних, які будуть використовуватися в програмі
    double x, xp, xk, dx, F, a, b, c;

    // Введення даних для x, xp, xk, dx та інших змінних
    cout << "xp = "; cin >> xp;
    cout << "xk = "; cin >> xk;
    cout << "dx = "; cin >> dx;
    cout << "a = "; cin >> a; 
    cout << "b = "; cin >> b;
    cout << "c = "; cin >> c;


    // Налаштування виводу для друку з фіксованим кількістю знаків після коми
    cout << fixed;

    // Вивід заголовка таблиці
    cout << "---------------------------" << endl;
    cout << "|" << setw(5) << "x" << " |"
        << setw(7) << "F" << " |" << endl;
    cout << "---------------------------" << endl;

    // Ініціалізація x початковим значенням
    x = xp;

    // Цикл обчислення і виводу результатів
    while (x <= xk)
    {
        // Обчислення значень F залежно від значення x
        if (x < 0 && b != 0)
            F = a * pow(x, 2) + b;
        else if (x > 0 && b == 0)
            F = (x - a) / (x - c);
        else
            F = x / c;
     
        // Вивід результатів у вигляді таблиці
        cout << "|" << setw(7) << setprecision(2) << x << " |" << setw(10) << setprecision(3) << F << " |" << endl;

        // Збільшення x на крок dx
        x += dx;
    }

    // Виведення підкінцевого рядка таблиці і завершення програми
    cout << "---------------------------" << endl;
    return 0;
}
